[ 
  
{
  "title": "#7 Player Review : 2024-25",
  "headline": "The surprises, and the disappointments",
  "date": "2025-05-24 23:30 (IST)",
  "author": "Bharat Surya Chamarthi",
  "image": "assets/img/barca_blogs/barcateam.png",
  "category": "Thoughts",
  "content": [
    {
      "season_overview": "A season of continued transition and growth. While not without its challenges, the integration of youth with experienced players showed promise. The team fought hard on all fronts, with moments of brilliance interspersed with periods of inconsistency. Overall, a step forward.",
      "introduction_paragraph": "<p>Now that the season is done, here are my thoughts on how each player has fared.</p>",
      "attackers": [
        {
          "name": "Lamine Yamal",
          "position": "RW/LW",
          "category": "Key Player & Generational Talent",
          "review": "Yamal built on his explosive breakout. Now a more consistent end-product player, his dribbling, creativity, and increasing goal threat made him Barcelona's most dangerous attacker. Still areas to refine in decision-making under pressure, but his ceiling is limitless. A true game-changer.",
          "rating_out_of_10": 9.0
        },
        {
          "name": "Robert Lewandowski",
          "position": "ST",
          "category": "Key Player & Developing Star",
          "review": "After a full pre-season and better integration, 'Tigrinho' truly bared his teeth. His relentless pressing, intelligent movement, and clinical finishing (when chances were created) were vital. Showed he can lead the line, though still adapting to the physical demands and complex build-up play at times. Significant improvement.",
          "rating_out_of_10": 8.0
        },
        {
          "name": "Rapinha",
          "position": "LW/ST",
          "category": "Important Contributor & Comeback Story",
          "review": "The fairytale return continued. While perhaps not the explosive force of his pre-injury self, Ansu demonstrated his intelligence and predatory instincts in front of goal. Managed his minutes well and contributed crucial goals. His leadership and experience were invaluable, especially for the younger forwards.",
          "rating_out_of_10": 7.5
        },
        {
          "name": "Ferran Torres",
          "position": "LW/RW/ST",
          "category": "Versatile Squad Player",
          "review": "Ferran remained a valuable squad member due to his versatility and work rate. Contributed goals and assists, particularly effective when coming off the bench or starting against specific opponents. Consistency remains his biggest challenge, but his attitude and professionalism were commendable.",
          "rating_out_of_10": 7.0
        },
        {
          "name": "Marc Guiu",
          "position": "ST",
          "category": "Young Prospect & Impact Sub",
          "review": "Guiu earned more first-team minutes and showed his poacher's instinct. A physical presence who offered a different profile up front. Still raw and needs to develop his all-around game, but proved he can make an impact, especially in tight matches. Promising.",
          "rating_out_of_10": 6.5
        }
      ],
      "midfielders": [
        {
          "name": "Pedri",
          "position": "CM",
          "category": "Key Player & Midfield Maestro",
          "review": "When fit, Pedri was sublime. His vision, control, and ability to dictate tempo were world-class. The team's performance levels visibly rose with him on the pitch. Fitness management remained crucial, but his influence was undeniable. Added a few more goals to his game.",
          "rating_out_of_10": 8.5
        },
        {
          "name": "Gavi",
          "position": "CM/LW",
          "category": "Key Player & Heartbeat of the Team",
          "review": "Returned from his long-term injury with his trademark tenacity and passion. His energy in pressing and ball-winning was infectious. Showed improved discipline and decision-making in the final third. An indispensable leader by example, despite his youth.",
          "rating_out_of_10": 8.5
        },
        {
          "name": "Frenkie de Jong",
          "position": "CM/DM",
          "category": "Key Player & Engine Room",
          "review": "De Jong continued to be a vital cog, especially in progressing the ball from deep and breaking lines with his dribbling. Showed more authority and took on greater responsibility in build-up and defensive transitions. A consistent performer who often set the tempo.",
          "rating_out_of_10": 8.0
        },
        {
          "name": "Fermín López",
          "position": "AM/CM",
          "category": "Solid Contributor & Goal Threat",
          "review": "Fermín cemented his place as an important squad player, offering energy, directness, and a surprising goal threat from midfield. His late runs into the box and powerful shooting were valuable assets. Still developing tactically but his impact was often immediate.",
          "rating_out_of_10": 7.5
        },
        {
          "name": "Noah Darvich",
          "position": "AM/CM",
          "category": "Emerging Talent",
          "review": "Darvich began to get more consistent first-team exposure, primarily in cup games and as a late substitute. Showcased his technical quality, vision, and composure on the ball. Needs more physicality and defensive awareness, but the raw talent is evident. One for the future.",
          "rating_out_of_10": 6.0
        },
        {
          "name": "Marc Casadó",
          "position": "DM",
          "category": "Reliable Squad Option",
          "review": "Casadó provided solid cover in the defensive midfield role. Disciplined, good positional sense, and tidy in possession. Lacked the dynamism of others but was a reliable option when called upon to provide balance and defensive security.",
          "rating_out_of_10": 6.5
        }
      ],
      "defenders_and_goalkeepers": [
        {
          "name": "Marc-André ter Stegen",
          "position": "GK",
          "category": "Key Player & World Class",
          "review": "Another stellar season from the German wall. His shot-stopping, command of the area, and crucial saves won Barça points on numerous occasions. His distribution remained a key part of the team's build-up. A true leader.",
          "rating_out_of_10": 9.0
        },
        {
          "name": "Ronald Araújo",
          "position": "CB/RB",
          "category": "Key Player & Defensive Rock",
          "review": "Araújo was the undisputed leader of the defense. His pace, power, and aerial ability were immense. Crucial in one-on-one duels and commanding in set-piece situations. A few lapses in concentration with the ball at feet, but defensively, he was a colossus.",
          "rating_out_of_10": 8.5
        },
        {
          "name": "Pau Cubarsí",
          "position": "CB",
          "category": "Key Player & Revelation",
          "review": "Cubarsí built on his phenomenal breakthrough season, establishing himself as a starting center-back. His composure on the ball, passing range, and defensive intelligence were remarkable for his age. Formed a strong partnership with Araújo. A future captain in the making.",
          "rating_out_of_10": 8.5
        },
        {
          "name": "Alejandro Balde",
          "position": "LB",
          "category": "Key Player & Attacking Outlet",
          "review": "Balde returned to his best, providing electrifying pace and attacking thrust down the left flank. His overlapping runs and crossing ability were key to unlocking defenses. Showed improvement in his defensive positioning and final ball.",
          "rating_out_of_10": 8.0
        },
        {
          "name": "Jules Koundé",
          "position": "CB/RB",
          "category": "Solid Contributor & Versatile Defender",
          "review": "Koundé provided his usual blend of solidity and versatility, playing both at center-back and right-back. Generally reliable, though sometimes struggled against particularly pacy wingers when at RB. His ability on the ball remained an asset.",
          "rating_out_of_10": 7.5
        },
        {
          "name": "João Cancelo",
          "position": "RB/LB",
          "category": "Attacking Full-back & Creative Spark (if permanent deal secured)",
          "review": "Assuming his stay was made permanent, Cancelo continued to be a unique attacking weapon from full-back. His creativity, passing range, and ability to drift infield caused constant problems for opponents. Defensive responsibilities were sometimes neglected, but his offensive output was often decisive.",
          "rating_out_of_10": 7.5
        },
        {
          "name": "Héctor Fort",
          "position": "RB/LB",
          "category": "Developing Youngster & Reliable Backup",
          "review": "Fort gained more minutes and showed maturity beyond his years. Solid defensively and composed in possession, he proved a reliable option at both full-back positions. Still developing his attacking game but looks a very dependable squad member for years to come.",
          "rating_out_of_10": 7.0
        },
        {
          "name": "Mikayil Faye",
          "position": "CB/LB",
          "category": "Physical Prospect & Squad Depth",
          "review": "Faye earned some first-team appearances, showcasing his impressive physique, speed, and aggression. Raw technically and tactically at times, but his potential is clear. Offered a different, more combative option in defense. Needs consistent game time to refine his abilities.",
          "rating_out_of_10": 6.0
        },
        {
          "name": "Iñaki Peña",
          "position": "GK",
          "category": "Reliable Backup",
          "review": "Peña performed capably when called upon. A solid shot-stopper and decent with his feet. Proved himself a trustworthy deputy to Ter Stegen.",
          "rating_out_of_10": 6.5
        }
      ]
    }
  ]
},

{
  "title": "#6 Season Review : 2024-25 ",
  "headline": "Why Hanis Flick deserves the credit for the team's success",
  "date": "2025-05-21 23:30 (IST)",
  "author": "Bharat Surya Chamarthi",
  "image": "assets/img/barca_blogs/Hansiflick.png",
  "category": "Thoughts",
  "content": "<p> FC Barcelona completed a domestic treble this season. The bus parade that followed post the Espanyol, took me back in time, where Barca was costantly winning something every season and these bus parades followered every la liga victory. This group of players have exceeded all expectations this season. Start of the season, with Hansi FLock in charge, I expected that there would surely be a change in the approach to the game, but wasnt sure if we had the players required to compete at the top level. I remember Xavi saying that Barca needed signings to compete in Europe and the current crop will require time to gain experience. Whilst, it is true that insufficient bench strength due to lack of signings costed in UCL, the players did show that they can compete in Europe and overocme the likes of Bayern and Inter Milan on any good day. When you look at the state of affairs when Flick arrived, there were no guaranteees of signings from the board due to FFP issues. Even if they could sign someone, the wage bill did not allow their registration. Amidst all these uncertainitnies , Flick didnt complain. He worked in silence and put his trust on La Masia kids. The presason went well with all the La Masia kids giving good impression. But remember it is still pre-season and teams are generally trying to get up to speed. It is natural that La Masia prospects would give their all in these kind of games. The final preseason game to Moanco ended in  a loss and I thought okay another disappoiniting in the making. However, Flick had other plans.  He bet on La Masia kids and players who had practically one foot outside Barcelona.  For the defensive line, aloing with a 17 year cubarsi, he used Inigo Martinez as the defensive pairing. Inigo, the season before only warmed the bench and looked as if he was in here for the retirement pension. But under flick, Inigo along with Cubarsi perfected the famous high line which became the talk of the footballing community in the days to come. He managed to bring the best out of Balde and Kounde both attacking and defence wise. This is where credit goes to Flick. He knew that both Inigo and Cubarsi are good with the ball and doesnt matter who is in form, he chose the players who fit his footbaling philosphy. Aruajo who was an undisputed strater under Xavi was a back up under Flick. Simialrily, Kounde became more impressive with his attack and Balde became more instrumental in turning defence into attack with his outrageous take-ons. In the midifled, he trusted Pedri, Casado and Olmo in the intial halof of the seson. Casado was a relevation and again FLick selected those players who suited his style of play. But there came a time where Casado was injured and so was Olmo. At the same time, Barcelona's great start to the season started to fade away. At this juncture, FLick adjusted. Fans were worried about the midfield since the replacement to Casado, Bernal was also out. But there was one veteran on the bench- Frenkie De jong. At that moment, fans were convinced that his time with Barca is done. But he raised like a pheonix. He was the player who provided what Barca lacked - control, the reason why they started lsoing. Sure there was Pedri who controlled the game but to get more attacking output from Pedri you need a player like FDJ to control the midfiled and open up spaces for Pedri. With inhuries to Dani Olmo, another La Masia kid Fermin Lopez, hero of the summer olympics stepped in with crucial goals. And now in the attcak, Lamine Yamal was the only unsurpsinig pick , thanks to his performance in the Euros 2024. He then trusted  Lewandowski as the main striker who had a terrible 23-24 season and rapinha who almost started looking for houses in Saudi. These three became a formiddable trio and looked like scoring everytime they had the ball especially during the first half of the season. However, it was not jsut the starting eleven that improved. Players like Ferran Torres, who I believe is one of the main reasosn for sucess this season stepped up when required. Eric Garcia was clutch and filled in muliple roles as a CB, RB, CDM and CM when other players needed rest. However, if there was one aspect where the lack of signings troubled Barcelona was in the defence. Flicks style relied on  the defence line completlety perfecting the offiside trap - when to drop back and when to move forward and all. Apart form the staring four, all others struggled to perfect it. Added to the injury of Christense, there was no one to relieve the center backs apart from ARaujo, who to be fair had a poor season. Simialrily, there were no quality repalcements for Balde and Kounde. Eric Garcia stepped in thankfully at right moments but you still feel that a bit more defensive stability was required in crucial games. But considering how the season went, Flick deserves a lion's share of credit for making Barca play beautiful football once again and showing the true levels of the players that we had. And no wonder, he extends his contract until 2027.  </p>"
},

{
  "title": "#5 Laliga: FC Barcelona are the champions of Spain : Thoughts",
  "headline": "Barca edge past city rivals Espanyol to clinch their 28th league title  ",
  "date": "2025-05-16 07:00 (IST)",
  "author": "Bharat Surya Chamarthi",
  "image": "assets/img/barca_blogs/champions.jpeg",
  "category": "Thoughts",
  "content": "<p> As expected, Barcelona won the league this week managing a 2-0 win against Espanyol. This was their 28th league title and their first in three years. Espanyol fans, being on the receving end of both the recent la liga title triumphs matches. And the worst part, they were releagted the last time, came back again only to see barca win the league in their home and still fighting relegation. Congrats to Hansi Flick, for the way he bought an identity to this team. Whats more important is that the youngsters who would be the future of barcelona in the coming decade will have an identity of their own and redefine the barca way, same as how xavi-iniesta-messi redefined the barca tiki-taka way back in the day. I am going to keep this one short, now that there is a season and player review coming up. </p>"
},

{
  "title": "#5 Laliga: FC Barcelona vs Real Madrid : Thoughts",
  "headline": "Barca make it 4 in a row against rivals Real Madrid as they stand just one win away from their 27th league title ",
  "date": "2025-05-12 19:10 (IST)",
  "author": "Bharat Surya Chamarthi",
  "image": "assets/img/barca_blogs/barcavsrma.png",
  "category": "Thoughts",
  "content": "<p> To be honest, I wasn't very excited for this game. The heartbreak of UCL semifinal was still there which took out the excitement from this game for me. Added to that, even if barca lost, they would still have a one point lead and try to win the remaining three matches to see it off. While all these thoughts were there, it was a rare early kickoff game, so i watched it anyway. Barcelona's second half of the season can be deifned by one word- remontada. This game makes it 5 remontada in a row. It's as if they dont find any joy  in scoring first. As for the match, Both the sides are weakened coming into this game. Barcelona, of course fatigued after that 120 min UCL clash, main players like kounde, balde and lewandowski still not fit for this game. Real Madrid were plagued with injuries in their defence with their main center backs; Rudiger being the new addition to their injury list whlst also is serving a ban for his off field antics. Mbappe was finally able to beat the offside trap this time around. To me, this indicated of what is about to happen in the coming seasons. Those defensive errors while maintaing a high line is what cost us against Inter and nearly cost us this game as well - two crucial games that make or break a season. This should not be repeated and hopefully Flick will work in the preseason.  The first half, I would say was mastered by pedri and dejong barring those two instnaces leading to mbappe's goals. No suprise they went 4-2 ahead at half time after goign 2-0 down. The seond half is where things started to change, where madrid bought more control with modric into the middle. Rapinha's missed chances nearly costed us this game if not for christensen's incredible lunging block to prevent a tap in for mbappe and a brillaint save from Tek to deny Mbappe's fourth. I wish Christensen stayed fit. In this season, I feel there are two reasons why Flick is forced to make defensive changes by often bringing in Araujo for Cubarsi or Inigo. The first reason is christensen not being fit. For Flcks system it is essential that the defenders are good with their feet, which sadly araujo isnt bu christensen is. The second being the injuries of defensive midfielders - Casado and Bernal. With dejong and pedri having that flare going forward, they are  that are not that imposive defensively. Sure, Pedri makes those recovery runs and often wins the ball back but you need pedri to control the game while someone else does the dirty work. Casado is the guy who does it. Therefore, when casado was injured we saw flick playing eric garcia to create this balance. Ultimately, it didnt work out and had to bring Araujo who sort of does the dirty work which sometimes has already proven costly. Apart from those missed chances form either ends in the second half, it was the referee who stole the limelight. Its better to not talk  about those terrible decisions. Right, so that concluded my thoughts and we are pretty much one win against Espanyol away from home next week to reclain the second league title in three years. Remeber the last time, we won it in Espanyol and their fans got trigerred. Deja vu for espanol coming this friday. Visca el Barca. </p>"
},


  {
  "title": "#4 UCL Semifinal 2nd Leg:  Inter Milan vs FC Barcelona : Thoughts",
  "headline": "Heartbreak for Barcelona as Inter Milan edges past them in a rollercoaster of a game",
  "date": "2025-05-07 22:50 (IST)",
  "author": "Bharat Surya Chamarthi",
  "image": "assets/img/barca_blogs/intermilan.png",
  "category": "Thoughts",
  "content": "<p> For the neutral fans of football, this would have been one hell of a game to watch. It was that kind of game which would have kept you at the edge of the seat. But If you are a barcelona fan, this is a tough pill to swallow, especially after a spirited comeback from 2 goals down and to lead the match 3-2 with just two minutes to full time. Yes, its only fair to raise questions, you may criticise for araujo's  poor marking of Acerbi and Thurram for those final goals, you may criticize why didnt we try to sit back when we got the lead. All of these are fair. But when I look back , jsut a day before the match, I knew that it was always going to be difficult to get past Inter Milan. In fact, I had my hopes low, already okay with what the team has achieved this season. I will give the reason why I felt this - Theres this saying - Attack wins you matches and defense wins you titles. In this leg, we did have great attack but our defense was weak. We have missed Balde and Kounde big time, Make no mistake, Eric and Martin have suprisingly pulled us back into the game. But it is still those small moments where experience, and game reading ability come into play and you have to be one step quicker. This is where we lost the match.  Thus, I wasnt surprised when we went 2-0 down and Inter had one step in the finals. But, I was thinking surely no coming back this time and Inter would not allow the same scenes happened last week in Montujuic to repat. But, suddenly barcelona stage a brilliant comeback and completly rattle inter milan at their own home where they have been undefeated in the past 15 european matches. Suddenly, there is a ray of hope after they comeback. You feel inching closer to the one big trophy that has eluded you the most. The nightmares and humiliations that I have gone through in all those european nights for the past 10 years post the UCL win in 2014-15 suddenly started getting a closure. So close yet so far. Inter Milan had other plans, take nothing away from them. They had one moment in the second half and they equalised. Took their chance in the extra time and did what they are the best at- Sit back and defend. Still, Barca kept on attacking. Of all days, Angel Sommer makes those incredible saves, some questionable decisions by referees in contex to the equalizer. You know, when you look at all these things, It feels may be luck was not on our side. At the end, there is this bitter sweet feeling of what could have been. I feel sad for all those efforts of players like Lamine, Pedri, Cubarsi and especially Inigo martinze, who I think was the reason for this level of football form Barcelona. I mean, youngsters may be they migh get another shot at it, but feel sad for Inigo, man.  Yes, I do feel a bit low today,  part due to lack of sleep. In hindisght, securing la liga will complete a domestic treble and considering where we were at the beginning of the season and how we were written off, I will take these trophies. On a lighter note, atleast we exit UCL with out heads held high and not with a stamp of humiliation, embarassment. On the other hand, I feel like, maybe this was the only chance we had at UCL. You could always go the next season but teams become stronger (example : City, Real Madrid, all other which did bad this season) and would have figured out how to breach our defenses. On the brighter side, this defeat will in fact motivate the players especially the young ones to complete an unfinshed business. For now, lets appreciate Flick and this team for their incredible efforts. Now go on and bring that League home. Stay tuned and watch this space for more Barca content. Visca El Barca.  </p>"
},
  {
    "title": "#3 UCL Semifinal 1st Leg: FC Barcelona vs Inter Milan: Thoughts",
    "headline": "Barcelona comes back twice to salvage a 3-3 draw in a cracker of a game",
    "date": "2025-05-01 07:30 (IST)",
    "author": "Bharat Surya Chamarthi",
    "image": "assets/img/barca_blogs/barcavsintermatch.png",
    "category": "Thoughts",
    "content": "<p> Well, If there is one player I hate more than anybody now is Dumfries. Dude is jsut everywhere on the pitch, constantly beating the offside trap only for his teammates to not release him or misplace a pass. As I predcited earleir, I always knew that we would leak goals especially from the left. That is what has happened. Maybe not for all three goals, but the attacking threat was always from that end. As expected Inter Milan,started off with a low block and expecting counters. But before they settled into this game, they just gave a glimpse of how quick they can score within the first 30 seconds of the match. It took sometime for Barca to settle into the rythm, but now Inter were doing what they do best. Sit back, and release the two forwards. they literally were doubling up on Lamine everytime he touches the ball. As it went on, Inter doubled their lead with a set piece corner, the culprit - DUMFRIES. I thought that it was done at this moment. Now, I knew that we came back earlier with this defict in la liga and copa del rey against atlectico madrid. But this is champions league semifinal and stakes are higher.  Until the second goal, I thought Inter had no surprsies and had the game under conterol.  Looking at the way how Inter was exposing our defense, a slight mistake here from Barca would have finsihed the tie. </p> <p> But this is where, teams look for a moment of inspiration. You need someone who puts up their hand and says we are still in this. That moment cam from Lamine Yamal. Once he scored that wonderful goal skipping past the defense, I thought the comeback was always going to happen and so , it did. The second goal was what we see when Barca's midifled and attack are at their best. I felt that Barca, only if they were not wasteful, should have taken the lead before the half time. And as I have been telling from the beginning, Gerard Martin is a weakness in the sqaud. And, rightly so, had to be replaced in the second half with araujo coming in. Come second half, Inter stepped up, started attacking and eventually took the lead again from DUMFRIES and again from a corner.  One area where Inter Milan excelled was at being very clinical becasue they knew that if Barce gives away the ball, there will be chances to score which have to be taken. Their only caveat was how to get the ball from Barca. Even at 3-2, I felt that Barcelona are going to come back and win the game because such was the nature of the game. Now they were tripling up on Lamine, who has been absolutety sensational in this match. And to my thoughts, Rapinha's thunderous strike   (although counted as owngoal)  made things even once again. This is where Barce has become better this season - If you go down, do not give the opponent enough time to settle down and dictate the pace of the game. the thing with barcelona is once they find an entry into the box, attacks will keep on coming. This is exactly what has happened with the score at 3-3, where it was Barca all over Intermilan's low block. But Inter with all their experience neghotaited the remaining game. There was a scare in betwwen when Mikhitaryan scored but was flagged offsie.</p> <p> Overall, I feel that the Barca will be happy going back since it is difficult to win everygame in this jam packed calendar. We always knew that the tie is going to be decided at Milan. Inter Milans clinical finishing made this match intersting and their execution of beating the high line would make them favourites for the second leg. But, if Barca are a bit more fresh and Balde and Kounde come back, I think Barca can upset Inter in the second leg. But for now, lets hope for there no more injuries in the weekend game. Visca el Barca </p>"
  },

  {
    "title": "#2 UCL Semifinal Preview: FC Barcelona vs Inter Milan",
    "headline": "How Barcelona's weaknesses can be exploited by Inter Milan and what to expect in the first leg.",
    "date": "2025-04-30 05:30 (IST)",
    "author": "Bharat Surya Chamarthi",
    "image": "assets/img/barca_blogs/uclsemifinal.png",
    "category": "Match Preview",
    "content": "<p> Barca will be coming into the match with high spirits after their win against real madrid in the  copa del rey final. There has been much talk on fatigue since they will be playing within 3 days after the cup final. Whilst its true that we will be seeing some tiring legs in the second half of the game, I think the cup win would have pushed their spirits to do something special for the remainder of the season starting from the UCL semifinal. So, in this moment, I guess its more about the mental aspect than the physical. Moreover, its time of the season, where you dont have to play good football to win but need to manage the games and be clinical. Barca will be hoping for dominating the first half and take a comfortable lead before they try to manage the game. Now, a lot hinges of how fresh pedri is and how, he along with frenkie would navigate the crowded midfield of inter milan. I expect fermin lopez to be in the lineup in place of olmo to make spaces for rapinha and ferran whilst also providing a constant attackign threat though his deep runs. So, I think we will  see a lot of long balls from martinez and cubarsi and deep runs from rapinha and fermin lopez. And, of course, there is Lamine Yamal. While he is doing great for a 17 year old, I hope that he shows a little more calmness and play simple football instead of showboating when there is an oppurtunity to seal the game.  Lewandowski will be a huge miss in this game becasue of his linkup play and shielding the defenders. I hope ferran steps up just like he did against Real Madrid.  Defensively, the only area for concern is the left back area, where reports suggest that Gerard Martin is going to start. While he did not have a terrible game against Madrid, I feel the weakness is more on the offensive than the defensive side. I feel the absence of an attacking threat from MArtin is isloating rapinha to do all the work offensively on that wing, which is why we also see rapinha reduced threat in the games. The only thing i expect of Martin is to not mess up the offside trap which we have been doing so well in the recent times.   </p> <p> On the other hand, Inter Milan enter this game with a string of defeats to Milan in the cup final followed by defeats to Roma in the league. This meant that Napoli overtook them as league leaders and is likely to win the league. But, I think Barca should not read too much into this. Sure It raises doubts whether Inter can cope up, but common, these are professional players and at the end of the day, playing Barcelona is enough motivation. As they say, every goalkeeper turns into prime Buffon when they play Barcelona. Such is the case for any player. Inter will focus on their strenghts which is their low block midfield and effective counterattacks intiiated by their very able and technically rounded midfield with Lautaro Martinez upfront in attack. Lautaro Martinex is one the best shielders of the long ball in my opinion. Their two striker combination is surely going to cause problems for Barcelona. We have seen how the two forward approach of Mbappe and Vinicius troubled Barcelona in the second half of the cup final. So, If cubarsi and martinex step up and anticipate and win those crucial 50-50 balls, I think Barca will be safe.</p> <p> Alright prediction time, I think the first half from Barca will be crucial. This would be game with a very few clear cut chances for Barce, should they should be clinical enough to put those half chances. So, I epxect a narrow 1-0 win or a 1-1 draw for Barcelona. I certainly know that the game will be decided in the second leg.  </p>"
  },

  {
    "title": "#1 Copa Del Rey Final: FC Barcelona vs Real Madrid: Thoughts",
    "headline": "Thriller at the andulusia  marred by controversies, red cards and as barcelona triumph 3-2 after an epic extra time winner by Jules Kounde",
    "date": "2025-04-27 05:30 (IST)",
    "author": "Bharat Surya Chamarthi",
    "image": "assets/img/barca_blogs/copadelrey.png",
    "category": "Thoughts",
    "content": "<p>This was that el-classico that fit the billing. Remeber those days of Mourinho and the subseqnet era of Messi and Ronaldo,when the whole footballing world was hyped up for the match. We had those classic taunts by Mourinho in the press, we had four players tacking Messi and leading to something not less than a world war. Well, this hype went down when ronaldo left real madrid. Although the rivalry existed, it wasnt the same atlesat for me, who watches these matches from India, completley oblivious to the larger history of this rivalry. Well, the pre-game lead up reminded me of that rivalry, however, this time it was more political.  For anyone who is under a rock, the fiasco involved - the madrid media accusing to be copa del rey final referee favouring barcelona, followed by the referee breaking down due to this harassment in the pre-game presser. Come match day, poor guy had to deal with a last minute penalty review which he initially awared to barca and eventually ws overturned. I mean,  you had to look at Rudiger at the last minute of extra time when foul was called Mbappe when he was on the attack. Rudiger was literlly throing objects onto the referee. All this may sound so bad when you look at the game of football, but isnt this what el-classico used to promise. Maybe I would have liked it if the referees werent lured into this, this drama would have been much more fulfilling if there was some potshots between the players. As i write down, i think the players due to their crammed calendars are protected from outsied noise these days, that they barely get anytime to respond. Any statement would only lead to a lot of social media scrutinty and hate from own fan bases. But that is a separate conversation. As far as the match was concerned, it was a classic. I missed the first 40 minutes as i dozed off to sleep, thanks to my pixel's alarm which didnt buzz. Barce were leading 1-0 by the time I startedd watching. I felt that this score was pretty dangerous against Real Madrid to go into the half time and it was. I thought that a quick gaol at the start of second half would have killed things off but thanks to rapinha and his poor fininshing, Madrid was able to come back into the game. I personally feel taht Rapinha hasnt been the same after the international break, Sure he had a huge role to play in the crucial win against Celta Vigo, but he had a very off game. He needs to be more clinicnal if we want that european glory. Coming back, I think Ferran Torres and Jules Kounde were the MOTM. Not just because they scored the crucialgoals but the holdup play of Ferran Torres I thought was good and defensively kounde played a huge role in the second half and especially in the extra time with crucial interceptions. More than Lounde's finish for the winner, His anticipation for that half ball was what made the goal. We won and thats great but if I were to see one area where we have to find some solution is the left back positon. Gerard MArtin had a very poor game giving away balls in his own half which led to multiple chances for Real Madrid. I think Fort or even Eric garcia should start there in champions league espically with the 3-5-2 that Inter Milan plays. This is the 32nd Copa del rey title for barca and the first of treble set that we are looking for. ALright, congratutions Culers, we deserve this. Visca el Barca. </p>"
  },

  {
    "title": "#0 My Homecoming to being a Culer",
    "headline": "Messi - Argentina - Barcelona - Football thats it!!",
    "date": "2025-04-26 11:00 (IST)",
    "author": "Bharat Surya Chamarthi",
    "image": "assets/img/barca_blogs/messi.png",
    "category": "",
    "content": "<p>I guess it was 2010 when i just finished my 8th grade is when I watched the FIFA World cup in a newly bought Videocon television at my home. I guess, randomly we were watching Argentina vs Mexico game late in the evening. That was my first ever football match I have ever watched or followed. There was this bearded man shouting from the touchlines for Argentina and a short man with long hair leading Argentina's attack. Of course, you may have guessed it, I am talking about El Diego Maradona and the G.O.A.T Lionel Messi. I see messi's name flash on the screen and i knew him from some previous newspaper articles. I think Argentina won that game and are now in the quarter finals of the world cup. I was thoeoughly impressed with the short guy and I proceeded to watch the next Argentina game with Germany. I still remeber Germany humilaited Argentina 4-0 but in between there was an offside goal disallowed for Argentina. Now, I didint knew what offside was and left scraching my head. Since I was not an avid follower of the sport, I was dissapointed Argentina lost and just carried on. But the genius of Messi was still in my head. Fast forward, i did not watch any of the remaining matches of the world cup. Cut to 2011, Barcelona apparently lift the Champions league and were all over the news. At that point of time, there was no coverage for Champions league in India, and even if there was, I think it was on ten Action channel , whihc was not avaialble fro our cable tv provider. So no football at all. Eventually the repeat telecasts were given on ten sports and I used to watch them to see if Messi is there in any of the games. Once  I knew he plays for Barcelona, I tried to check if any barcelona repeat game was on. funnily, I once misttok David dilva for Lionel Messi. Long story short, throught the Hindu newspaper and the sportstar magazines, I sort of understood how club football worked and eventually I started following barcelona's games in 2011-12 season. At this point, I was not watching any live football, but only the repeat telcasts or highlights to know the result. since the matches used ot happn midnight, the newapapers gave the results the day after the match. This was a time where we had no mobile phone and a computer with internet acess. As it went on, there were heratbreaks when Barca lost to Ac milan in UCL first leg and cleberations when we did the remontada with 4-0. Then there was this Bayern Munchen team which decimated Barca 7-0 in the semifinals. My introduction to football happened thourgh messi and the introducion to how football is played happened to FC Barcelona. The reason why i fell in love with this club was simple. What is the aim of football as a game: (i) Its a team game (ii) You score more goals than the opponent and you win (iii) and how do you score goals by carrying the ball and making passes if you alone cant carry. Thats it Fc Barelona perfectly fit into my idea of what football is. Once i was lured into it, there was no coming back, I watched the hell out of all the premiere league games which were telecasted by our cable provider. I enjpyed the times of OG Man united, Arsenal, Thiery Henrys comeback goal, Rooney's Bicycle, Suarez's breakout season, Chelses breaking Barca's heart in UCL and what not. Supporting this team is nothing short of a roller coaster. We had our high during th e2014-15 treble season. Messi made me love football, gave me a reason to watch the game staying up in the nights. When he left, I realzed Messi was jsut the best worn hole to another unknown galaxy. If the new galaxy looks great you dont wanna go back even if the worm holes closing. </p>"
  }
  

]
