[
  {
    "title": "#0 What actaully is Cryogenics ?",
    "headline": "Kickstart your journey into the world of cryogenics with this beginner-friendly introduction.",
    "date": "April 27, 2025 13:30 (IST)",
    "author": "Bharat Surya Chamarthi",
    "category": "Cryogenics 101",
    "image": "assets/img/cryogenics_blogs/blog_1.png",
    "content": 

      [
        "<p>Every time I tried explaining what cryogenics meant to a layman I ended up failing. All one could associate it with is ISRO and rocket engines. It makes sense because these are what we generally see in the news and often talked about. Of course, people have heard the word Cryogenics but do not know what it actually is. Here I am, to make this explanation easy, interesting and fun for you. So, grab a coffee and relax, as we lift off to explore the world of cryogenics.<br/>If you open any textbook on cryogenics, you’ll find it defined as the branch of science and engineering that deals with processes occurring at <strong>very low temperatures</strong>. The word itself comes from two parts: <em>\"cryo\"</em> meaning <em>cold</em>, and <em>\"genics\"</em> meaning <em>production</em>. So, at its core, <strong>cryogenics is the science of producing and dealing with very low temperatures</strong>.<br/> But what does that really mean? Cryogenics as a field is quite broad. It looks at:<br/> 1. How to create very low temperatures (the science of cooling things down),<br />2. How to design systems that operate at these temperatures, which is where engineers like me and applied physicists come in,<br />3. How known physical processes behave when taken to these extremes, often revealing strange and fascinating behavior at the atomic or quantum scale—the kind of stuff physicists love to explore.<br/><br/> So you see, cryogenics isn’t just about one type of science or engineering. It’s a blend of mechanical, chemical, electrical, and physical sciences. It’s a truly interdisciplinary field.<br/><br/> Now, when we say “very low temperatures,” it’s natural to wonder: <br/> 1. Why do we even care about such low temperatures?<br/>2. What makes them so interesting to study?<br />3. How cold is \"cold\" in this context, exactly?<br />4. And more importantly, does any of this affect me in daily life?<br/>Great questions—and we’ll dive into all of them in the next post. For now, just remember: <strong>cryogenics isn’t just cold science—it’s a cool one too.</strong></p>"
      
      
    ]
  },
  {
    "title": "#1 Into the past: The History of Cryogenics",
    "headline": "Explore the fascinating history of cryogenics and its evolution over the years.",
    "date": "April 27, 2025 14:30 (IST)",
    "author": "Bharat Surya Chamarthi",
    "category": "Storage & Safety",
    "image": "assets/img/features-light-1.jpg",
    "content": "<p>Storing substances at cryogenic temperatures requires specialized equipment and strict safety measures. This article covers the types of storage vessels, insulation techniques, and the latest advancements that make cryogenic storage safer and more efficient.</p>"
  },
  {
    "title": "Why study Cryogenics: The applications, Part 1 ",
    "headline": "Discover how cryogenics plays a significnat role in our industries and how it affects you daily",
    "date": "April 13, 2025",
    "author": "Bharat Surya Chamarthi",
    "category": "Industry Applications",
    "image": "assets/img/features-light-2.jpg",
    "content": "<p>Right, so the last bolg, we have left you with a fe questions to think over- like why to even study cryogenics. Is there any benefite to mankind. So, let stry to uncover these inquisitive wraps in this post. <br/> To uncover these lets start with what we are familiar with. Lets say i gave you a cup of hot coffee and you feel its pretty hot. What would you do to make it colder -- (1) You would turn on the fan and let the air flow rapidly and take away the heat. However, you find that its taking longer times to cool down this way and you have a meeting to attend to , what would you do (ii) may be take a few icecubes from your refrigerator and kep it around the cup. There you have it, you managed to cool down your coffee to your desired comfort levels.    See what you have done there -- you have used a coolant - air or ice cubes to cool ddown something. By cooling down something, you were able to achieve something (in your case, getting a good coffee). Now what if i tell you, simialrlioy there are some things that will happen to some substances, when you cool them down so low. Even below the temperature of ice, even below the lowest temperature naturally occurring on earth. Materails that we know as stable at room temperatuire suddenly act wierdly at those temperatures. A popular example will be of electrical conductivity. You all know, that we use copper wires in our homes for electrical conduction and we have learned that each wire has its own ressitance which eseentiallyu is a barrier to the flow of current, right. So, heres the deal, if you cooled some materials (not copper but other specail materials) to very low temperature, they give you no ressitacne. Which means you can transfer energy without any losses. For industires, this is a boon becasue their rehcnology, processes become efficient and inturn give monetary benfits. So, how do we reach that low temperature then. well just like how you cooled your coffee uisng ice. But here, ice wont do. You would need some coolant way colder. The question is like, ice, what is that material that we can use as coolant and how to produce that low temperature. This is the essence of cryogenic engineering: How to produce cold (design of systems and processes than enable this) and how to operate other equipment at this temperatures.  That is a question for later. Now that you have known, how relevant is cryogenics with a intersting example,  lets focus on other such important applications of those low temperatures ion various sectors of our life. (1) I have alterady told you how superconductivity works. Lets assume that we have replaced all our elctrical lines with supercodncutring cables, all of a sudden you would have reliable grid energy at your homes and no power disruptions. Another impoertant use of this supecondictivity is in the MRI scanners which take clear images of your internal body organs. HAdnt the technology of low temperaure production been there, MRI as we know today wouldnt have existed. (2) Food sector: another popular exmaple of low temperatures is freeze drying, food processing. Qucik freezing usually helps our food products to last longer without losing their nutritional benfits. Ever wondered how food such as exotic fruits, and meat not typically produced locally are still avaialble in nearby restaurants. (3)Pharma sector:  Cooling down vaccines to enable a process called lyophyilization which helps to presereve vaccines and pharma products. Remeber those times, when the covid vaccines were supposeldy costly because of the low temperature conditions required to mantian their effectiveness. (4) Space applications: A lot of electronic systems used in imaging satellite such as the space telescopes emit heat as they work. This heat has to be quickly removed, or else the chip will get fried. Low temperatures help to maintain the chips in working conditions.</p> </p> Until now, we have seen most the applications which people do not even assocaite cryogenics with. Now, we have seen systems which require low temperatures and what happens to materials in those conditions. We understood that we need some special type of coolants to achieve these desired temperatures. These special type of coolants are called cryogens. Now then, what makes them so special. We will look at that in our next blog and uncover few other applications of the cryogenics which are even more fascinating.   </p>"
  },
  {
    "title": "Liquid Nitrogen: Handling and Hazards",
    "headline": "Learn about the safe handling of liquid nitrogen and the hazards associated with it.",
    "date": "April 6, 2025",
    "author": "Bharat Surya Chamarthi",
    "category": "Safety",
    "image": "assets/img/features-light-3.jpg",
    "content": "<p>Liquid nitrogen is one of the most commonly used cryogenic liquids. This post explains its properties, the risks involved in handling it, and the best practices to ensure safety in labs and industry.</p>"
  }
]
