[
  {
    "title": "#0 What actaully is Cryogenics ?",
    "headline": "Kickstart your journey into the world of cryogenics with this beginner-friendly introduction.",
    "date": "April 27, 2025 13:30 (IST)",
    "author": "Bharat Surya Chamarthi",
    "category": "Cryogenics 101",
    "image": "assets/img/cryogenics_blogs/blog_1.png",
    "content": 

      [
        "<p>Every time I tried explaining what cryogenics meant to a layman I ended up failing. All one could associate it with is ISRO and rocket engines. It makes sense because these are what we generally see in the news and often talked about. Of course, people have heard the word Cryogenics but do not know what it actually is. Here I am, to make this explanation easy, interesting and fun for you. So, grab a coffee and relax, as we lift off to explore the world of cryogenics.</p>",
        
        "<p>If you open any textbook on cryogenics, you’ll find it defined as the branch of science and engineering that deals with processes occurring at <strong>very low temperatures</strong>. The word itself comes from two parts: <em>\"cryo\"</em> meaning <em>cold</em>, and <em>\"genics\"</em> meaning <em>production</em>. So, at its core, <strong>cryogenics is the science of producing and dealing with very low temperatures</strong>.</p>",
        
        "<p>But what does that really mean?</p>",
        
        "<p>Cryogenics as a field is quite broad. It looks at:</p>",
        
        "<p>1. How to create very low temperatures (the science of cooling things down),<br />2. How to design systems that operate at these temperatures, which is where engineers like me and applied physicists come in,<br />3. How known physical processes behave when taken to these extremes, often revealing strange and fascinating behavior at the atomic or quantum scale—the kind of stuff physicists love to explore.</p>",
        
        "<p>So you see, cryogenics isn’t just about one type of science or engineering. It’s a blend of mechanical, chemical, electrical, and physical sciences. It’s a truly interdisciplinary field.</p>",
        
        "<p>Now, when we say “very low temperatures,” it’s natural to wonder:</p>",
        
        "<p>1. Why do we even care about such low temperatures?<br />2. What makes them so interesting to study?<br />3. How cold is \"cold\" in this context, exactly?<br />4. And more importantly, does any of this affect me in daily life?</p>",
        
        "<p>Great questions—and we’ll dive into all of them in the next post. For now, just remember: <strong>cryogenics isn’t just cold science—it’s a cool one too.</strong></p>"
      
      
    ]
  },
  {
    "title": "#1 Into the past: The History of Cryogenics",
    "headline": "Explore the fascinating history of cryogenics and its evolution over the years.",
    "date": "April 27, 2025 14:30 (IST)",
    "author": "Bharat Surya Chamarthi",
    "category": "Storage & Safety",
    "image": "assets/img/features-light-1.jpg",
    "content": "<p>Storing substances at cryogenic temperatures requires specialized equipment and strict safety measures. This article covers the types of storage vessels, insulation techniques, and the latest advancements that make cryogenic storage safer and more efficient.</p>"
  },
  {
    "title": "Applications of Cryogenics in Modern Industry",
    "headline": "Discover how cryogenics is revolutionizing various industries and what the future holds.",
    "date": "April 13, 2025",
    "author": "Bharat Surya Chamarthi",
    "category": "Industry Applications",
    "image": "assets/img/features-light-2.jpg",
    "content": "<p>Cryogenics plays a vital role in fields like medicine, space exploration, and food preservation. Learn about real-world applications and how ongoing research is expanding the possibilities of this fascinating science.</p>"
  },
  {
    "title": "Liquid Nitrogen: Handling and Hazards",
    "headline": "Learn about the safe handling of liquid nitrogen and the hazards associated with it.",
    "date": "April 6, 2025",
    "author": "Bharat Surya Chamarthi",
    "category": "Safety",
    "image": "assets/img/features-light-3.jpg",
    "content": "<p>Liquid nitrogen is one of the most commonly used cryogenic liquids. This post explains its properties, the risks involved in handling it, and the best practices to ensure safety in labs and industry.</p>"
  }
]
