[ 


{
  "title": "#4  Why < 120 K is assumed to be cryogenics ",
  "headline": "Intentions and stories behind cryogenics",
  "date": "May 18, 2025 13:30 (IST)",
  "author": "Bharat Surya Chamarthi",
  "category": "Industry Applications",
  "image": "assets/img/cryogenics_blogs/blog3.png",
  "content": "<p> In this blog, let us look into the history of cryogenic to see how this 120 K temperature came about - whats the story behind this.   </p>"
},

  {
    "title": "#3 Introducing cryogenic liquids",
    "headline": "Exploring Why Only Certain Liquefied Gases Can Serve as Coolants at Ultra-Low Temperatures",
    "date": "May 17, 2025 23:30 (IST)",
    "author": "Bharat Surya Chamarthi",
    "category": "Industry Applications",
    "image": "assets/img/cryogenics_blogs/blog3.png",
    "content": "<p>In the last two blog, we have seen where low temperatures are used for various applications. Additionally, we have also seen how the phsyical changes that occur by cooling down gases into liquid finds large industrial application. Specifically, we have talked about some gases such as natural gas, hyrdogen in addition to nitrogen, argon, oxygen etc which all exist as gases at ou normal room temperature. It is not a coincidence the cooling mediums required for various low temperature applications discussed in #1 are these liquid forms of these gases itself. By now, it pretty evident that the temperatures that we are talking about are pretty low - I mean hundreds of degrees below zero. Now, the question comes up - If we are using some process to produce low temperature why not just apply this process on say, easily available water and use it as a coolant at the desored temeprature. Anyway, it it ice no matter how below you go zero. Right ?. Well, there are a few limitations and fundamental issues in doing that. First, the very process of producing low temperature requires the cooling medium to flow through various equipment. Now, say if you are using water and try to cool it down, it freezes out the moment the temperature in the equipment becomes less than zero. As you know, solid does not flow easily and inhibits further flow. Thus, we will not be able to achieve required temperatures. So, the primary requirement is that the cooling medium must be in the form of a gas or a liquid even at those low temperatures. This enables (i) mantaining flow through equipment so that the required application can be cooled down easily by immediately taking away the heat using the flowing medium. If we allow a bit of science to interpret this, we need those substances which at best exist have exteremly low boiling points and extremely low freezing points. Ideally, the freezing point should be below the required application temperature and the boiling point temperature can be above the application temperature. This means, the coolant is now a liquid which takes out the heat from the application. Now, why liquid why not gas - both flow well, infact gas can easily flow then why specifically liquid ? Well, the simple answer to that is liquid is more effective in removing heat than gas due to superior value of a property called thermal conductivity. We will not go into these aspects now. And there is another great reason, why liquid is preferred over gas. Any guesses ? It is easier to detect leakages while dealing with liquids than gases.  A visual inspection will confirm the presence of liquid leak while in case of gases, we need highly specialized equipment to detect any leaks. Of course there are other disdavntages with liquid as well but the advantages are way more attractive.  So, it turns out that there are some specific set of gases which are liquids at the temperatures we are talking about. These specific set of gases as I have listed previously are called cryogens. All these gases becomes liquids at different temperatures below a temperature of 120 Kelvin; this 120 K temperature is sort of an unwritten boundary than defines the temperature of cryogenics domain. Now, remember, many of applications mentioned in #1 need temperatures below 120 K but there are a few applications above 120 K as well. So, technically they may not count as cryogeic temepratues; But hey, we cryogenic engineers dont complain and we have adopted those applications as our own since we can achieve way lesser temperatures than required.  Its like having we had more money than required so we went ahead and started sponsoring various charitable events. But how did this 120 K come about ? Whats the story and history behind this ? Well, that is for the next blog. Keep visiting this space for more cryogenics content.   </p>"
  },

  {
    "title": "#2 Why and what of Cryogenics: The applications, Part 2 ",
    "headline": "Discover how cryogenics plays a significnat role in our industries and how it affects you daily life",
    "date": "May 16, 2025 00:50 (IST)",
    "author": "Bharat Surya Chamarthi",
    "category": "Industry Applications",
    "image": "assets/img/cryogenics_blogs/blog_2.jpeg",
    "content": "<p>In the last blog, we have seen how low temperatures are essential for some real-life applications. In this blog, let us go a bit further and look at some more applications where low temperatures are beneficial. Apart from cooling applications, cryogenics or the attainment of low temperatures also helps us to store and transport fuels, industrial gases used in the making of cement, fertilizers in a more econmic way Before dwelving into how attaiing low temepratures enables this, let us take a step back and refesh some basics. It is well known that any matter can exist in three distinct forms - as a solid, liquid and a gas. By alterning the temperature and pressure, one can go from one state to another. For instnace, cooling down a liquid at constant pressure will turn it into a solid. The temeprature where this change happens is what we call as the freezing point. Similarily, increasign the pressure of a vapor at constant temperature will result in the formation of liquid. Thus, every material has its own boiling point and a freezing point. ANd we also know that solids occupy the least space since the molecules are closely arranged while gas occupies large volumes because the moleucles are very far part. This means that if 1 kg of susbtance needs to be stored or contained, storing it as a solid will occupy less volume than storing it as a gas. As a result, I can bring down the costs associated with storage. Altenratley, if some space is provided to me, i can store more mass of the substance if i store it as a solid. This very fundamental is exploited by cryogenics to store fuels like natural gas, hydrogen and oxidizers like oxygen and other gases.  We all know that natural gas , one of the popualr fuels for cooking comes through a pipeline as a gas to your burner stove. But if u look back into the supplu chain, you will find that even though natural gas is obtained directly as a gas,  it is stored and transported as  a liquid and then is made into gas before reaching your home. By doing so, the supplier is able to cut down costs of storage and transportation and ia able to export large quantities of fuel as liquid as opposed to as a gas. And how does he manage to do that - by cooling the fuel to the condesnation temperature of the fuel where it turns into a liquid. Let me just give you a quantitative figure that indicates monetary benefit of such conversion - say a ship(generally used to transport fuel between nations) equipped with a container stores natural gas in the form of a liquid as opposed to a gas. Storing it as a liquid would mean that the volume required to store the same mass is reduced by 600times.  If the contianer were to transport it as a gas, becasue of its larger space requirement, the ship would have had to make 600 trips to transport the same amount of natural gas as opposed to just one trip as a liquid. You see this is a game changer. And how does cryogenics come into play - well the fuel that we are talking about is natural gas which becomes a liquid at -153 degrees below zero.  And , yes , to reach those low temperatures, you need cryogenic engineering. The process of turning this gas into a liquid is what we call as the liquefaction. And not just hydrogen and natural gas, gases such as argon, nitrogen, oxygen, are all liquefied for their transport. The end consumption may be as a gas but for logistic reasons and monetary reasons, industries find it logical to spend energy on liquefaction for storage and transport. Another important and well knwon exploiter of such low temperatures is for the storage of another importatn fuel, hydrogen and an oxidzer - oxygen. It is well known that hydrogen when ignited in presenc of oxygen causes a combustion reaction and provides vast amount of energy. Therefore, our rockets use hydrgoen as the propellant and oxygen as the oxidizer to propel the rockets into space.  As you might have already guessed, both these gases are stored as liquids in the rocket propulsion system, simply beacuse that payload delivery is the aim of a rocket launch and one has to make all the other systems compact so that the more payload can be added besides the fact that more fuel can be stored in less volume. Can you imagine our rocket being 100 times longer if cryognics didnt exist. The cryogenic engine that people actually talk about is in fact a misnomer - it is more of the liquid propulsion stage.A cryogenic engine is a part of the propulsion stage which happens to use a propellant mantianed at very low temperatures. The next time you look at a spacex or NASA rcokcet launch, look for the white smoke/fog like susbtance coming out from the sides even before liftoff. It is the stored liquid hydrogen and oxygen at very low temperatures turning into gas due to the heat of the surrounding room temperature air. There you have it, two of the major applications of cryogenics explained. And there is one more application, which is not known but is relevant than any of the above. All this while, I kept on referring to each gases separely as nitrogen, oxygen and argon. But naturally these do not occur separately. The source of all these gases- air is a mixture of all these components. If you look at oxygen used in hospitals, it is in its purest form (99.9%). But, our atmosphere consists of 21% oxygen while rest is nitrogen, argon and other gases.  Ever wondered how are we able to separate out oxygen with such purity from our surroundings. Yes, you guessed it right, we use some cryogenic means (using low temperatures) to achieve this.  how it is done is a very difficult thing to explain in this series and it involves something that gives nightmares to mechanical engineering like myself. So, there it is all the important applications of cryogenics. </p>"
  },
  {
    "title": " #1 Why and what of Cryogenics: The applications, Part 1 ",
    "headline": "Discover how cryogenics plays a significnat role in our industries and how it affects you daily life",
    "date": "May 04, 2025 11:50 (IST)",
    "author": "Bharat Surya Chamarthi",
    "category": "Industry Applications",
    "image": "assets/img/cryogenics_blogs/blog_2.jpeg",
    "content": "<p>Right, so the last blog, we have left you with a fe questions to think over- like why to even study cryogenics. Is there any benefite to mankind. So, let stry to uncover these inquisitive wraps in this post. <br/> To uncover these lets start with what we are familiar with. Lets say i gave you a cup of hot coffee and you feel its pretty hot. What would you do to make it colder -- (1) You would turn on the fan and let the air flow rapidly and take away the heat. However, you find that its taking longer times to cool down this way and you have a meeting to attend to , what would you do (ii) may be take a few icecubes from your refrigerator and kep it around the cup. There you have it, you managed to cool down your coffee to your desired comfort levels.    See what you have done there -- you have used a coolant - air or cold water or ice to cool down something. By cooling down something, you were able to achieve something (in your case, getting a good coffee). Now what if i tell you, simialrlioy there are some things that will happen to some substances, when you cool them down so low. Even below the temperature of ice, even below the lowest temperature naturally occurring on earth. Materails that we know as stable at room temperatuire suddenly act wierdly at those temperatures. A popular example will be of electrical conductivity. You all know, that we use copper wires in our homes for electrical conduction and we have learned that each wire has its own ressitance which eseentiallyu is a barrier to the flow of current, right. So, heres the deal, if you cooled some materials (not copper but other specail materials) to very low temperature, they give you no ressitacne. Which means you can transfer energy without any losses. For industires, this is a boon becasue their rehcnology, processes become efficient and inturn give monetary benfits. So, how do we reach that low temperature then. Well just like how you used a medium, such as a gas (air) , liquid(water) or a solid(ice) to cool donw your coffee, you use a medium to reach those low temperatures. The only difference is you have to reach way colder temperatures below zero (ice temperatire). The special properties that i talk can occur at temperatures even below the naturally ocurring temperatures on earth. Now the important question - It is easy to cool down coffee since we had water or ice easily (essentially a cooling medium or a low temperature source which allowed you to cool down your material, i.e, coffee) at our disposal.  Then how can anyone reach such low temperatures ?  The answer to this question is fundamental to the existence of cryogenic engineering: How to produce such cold temperatures (design of systems and processes than enable this) and how to operate equipmenta at these cold temperatures. We will come to this answer later in much detail in later blogs, but for now, I will give a very rudimentary understadning. We go back to the cooling coffee example. Think about how you were able to turn water into ice. You should have used a refrigerator that cooled your water down to a point where it turned into ice. Now, see, the refrigerator should have done something to achive 0 degrees celcius to form ice. It would have done some processes intenrally to reach that temperature. That is what we call a thermodynamic process. Similarily, to reach even colder temeprature you do these thermodynamic processes (may be of different type) to utlimately reach those colder temperatures. Now, depending on what you are cooling , just like how you converted water to ice at 0 degrees, you can convert say, a gas into a liquid, or a liquid into a solid at much lower temperatures.  Now that you have known atleast at a surface level how cold temperatures are reached and why do we need those cold temepratures, let us look into a few more areas where low temperatures are required in various sectors of our life. (1) We have alterady seen how superconductivity works. Lets assume that we have replaced all our elctrical lines with supercodncutring cables, we would get good quality and reliable energy, no voltage fluctuations, and possibly at a cheaper price.  Another important use of this supecondictivity is in the MRI scanners which take clear images of your internal body organs. Thanks to the technology of low temperaure production, MRI technology exists. (2) Food sector: another popular exmaple of low temperatures is freeze drying, food processing. Qucik freezing usually helps our food products to last longer without losing their nutritional benfits. Ever wondered how food such as exotic fruits, and meat not typically produced locally are still avaialble in nearby restaurants. (3)Pharma sector:  Cooling down vaccines to enable a process called lyophyilization which helps to presereve vaccines and pharma products. Remeber those times, when the covid vaccines were supposeldy costly because of the low temperature conditions required to mantian their effectiveness. (4) Space applications: A lot of electronic systems used in imaging satellite such as the space telescopes emit heat as they work. This heat has to be quickly removed, or else the chip will get fried. Low temperatures help to maintain the chips in working conditions.</p> </p> Until now, we have seen most the applications which people do not even assocaite cryogenics with. And most of these applications use cryogenics to cool down their processes, equipment etc. However, there are some more interersting use cases and applications of the low temperatures which we will see in the next blog. </p>"
  },

  {
    "title": "#0 What actaully is Cryogenics ?",
    "headline": "Kickstart your journey into the world of cryogenics with this beginner-friendly introduction.",
    "date": "April 27, 2025 13:30 (IST)",
    "author": "Bharat Surya Chamarthi",
    "category": "Cryogenics 101",
    "image": "assets/img/cryogenics_blogs/blog_1.png",
    "content": 

      [
        "<p>Every time I tried explaining what cryogenics meant to a layman I ended up failing. All one could associate it with is ISRO and rocket engines. It makes sense because these are what we generally see in the news and often talked about. Of course, people have heard the word Cryogenics but do not know what it actually is. Here I am, to make this explanation easy, interesting and fun for you. So, grab a coffee and relax, as we lift off to explore the world of cryogenics.<br/>If you open any textbook on cryogenics, you’ll find it defined as the branch of science and engineering that deals with processes occurring at <strong>very low temperatures</strong>. The word itself comes from two parts: <em>\"cryo\"</em> meaning <em>cold</em>, and <em>\"genics\"</em> meaning <em>production</em>. So, at its core, <strong>cryogenics is the science of producing and dealing with very low temperatures</strong>.<br/> But what does that really mean? Cryogenics as a field is quite broad. It looks at:<br/> 1. How to create very low temperatures (the science of cooling things down),<br />2. How to design systems that operate at these temperatures, which is where engineers like me and applied physicists come in,<br />3. How known physical processes behave when taken to these extremes, often revealing strange and fascinating behavior at the atomic or quantum scale—the kind of stuff physicists love to explore.<br/><br/> So you see, cryogenics isn’t just about one type of science or engineering. It’s a blend of mechanical, chemical, electrical, and physical sciences. It’s a truly interdisciplinary field.<br/><br/> Now, when we say “very low temperatures,” it’s natural to wonder: <br/> 1. Why do we even care about such low temperatures?<br/>2. What makes them so interesting to study?<br />3. How cold is \"cold\" in this context, exactly?<br />4. And more importantly, does any of this affect me in daily life?<br/>Great questions—and we’ll dive into all of them in the next post. For now, just remember: <strong>cryogenics isn’t just cold science—it’s a cool one too.</strong></p>"
      
      
    ]
  },
  {
    "title": "Liquid Nitrogen: Handling and Hazards",
    "headline": "Learn about the safe handling of liquid nitrogen and the hazards associated with it.",
    "date": "April 6, 2025",
    "author": "Bharat Surya Chamarthi",
    "category": "Safety",
    "image": "assets/img/features-light-3.jpg",
    "content": "<p>Liquid nitrogen is one of the most commonly used cryogenic liquids. This post explains its properties, the risks involved in handling it, and the best practices to ensure safety in labs and industry.</p>"
  }
]
